test_request = {
    "date_for_first_week":"15.09.2025",
    "data":[
        {
        "monday":{
            1:"Философия технических наук лек. Ерофеева К.Л. А406",
            2:"Философия технических наук сем. Ерофеева К.Л. А406",
            3: "Ин. яз. делового и проф. общения сем. Тюрина С.Ю. Б321а",
            4:"Информационный менеджмент сем. Елизарова Н.Н. Б319а"
        },
        "thuesday":None,
        "wednesday":None,
        "thuersday":{
            4:"Организационное поведение лек. Карякин А.М. А211",
            5:"Организационное поведение сем. Карякин А.М. А211",
            6:"Архитектура предприятий и инф.систем лаб. Аникин Е.Н. Б319",
        },
        "friday":None,
        "saturday":None,
    },
        {
        "monday":None,
        "thuesday":{
            2: "лаб. Управление ЖЦ ПО Садыков А.М. Б306",
            3: "лаб. Информационный менеджмент Елизарова Н.Н. Б319",
            4: "лек. Информационный менеджмент Елизарова Н.Н. Б319а",
            5: "лек. Методология научных исследований Пантелеев Е.Р. Б310"
        },
        "wednesday":{
            4: "сем. Методология научных исследований Пантелеев Е.Р. Б310",
            5: "лаб. Методология научных исследований Пантелеев Е.Р. Б306",
            6: "лек. Архитектура предприятий и инф. систем Аникин Е.Н. Б310",
        },
        "thuersday":{
            3: "сем. Ин. яз. делового и проф. общения Тюрина С.Ю. Б321а",
            4: "лек. Управление ЖЦ ПО Садыков А.М.",
            5: "сем. Управление ЖЦ ПО Садыков А.М.",
            6: "сем. Архитектура предприятий и инф. систем Аникин Е.Н. Б319а"
        },
        "friday":None,
        "saturday":None,
    },
    ]
}

test_time = {
    1: "8:00 - 9:35",
    2: "9:50 - 11:45",
    3:"11:40 - 13:15",
    4:"14:00 - 15:35",
    5:"15:50 - 17:25",
    6:"17:40 - 19:15",
    7:"19:25 - 21:00"
}